var data = [
    {
        id: 1541821454355,
        pid: 0,
        position: {x: 0.45625, y: 0.1458333333333333},
        text: "神仙下凡辛苦了",
        vip: 1
    },
    {
        id: 1541821558165,
        pid: 0,
        position: {x: 0.1628571428571429, y: 0.2645833333333333},
        text: "丝桐，你瘦了。。",
        vip: 2
    },{
        id: 1541830344641,
        pid: 1,
        position: {x: 0.3375, y: 0.6416666666666667},
        text: "萌萌哒",
        vip: 0
    },{
        id: 1541841550702,
        pid: 2,
        position: {x: 0.59375, y: 0.25},
        text: "呆傻",
        vip: 0
    },{
        id: 1541841639030, 
        pid: 3, 
        text: "酷~~啊", 
        position: {x: .1, y: .21},
        vip: 1
    },{
        id: 1541841742304,
        pid: 3,
        position: {x: 0.175, y: 0.25625},
        text: "O(∩_∩)O哈哈~",
        vip: 2
    },{    
        id: 1542622160657,
        pid: 0,
        position: {x: 0.428125, y: 0.3458333333333333},
        text: "太sex了",
        vip: 2
    },{
        id: 1542622204972,
        pid: 0,
        position: {x: 0.053125, y: 0.825},
        text: "性感漂酿",
        vip: 1
    },{
        id: 1542622254744,
        pid: 0,
        position: {x: 0.540625, y: .6},
        text: "美艳不可方物",
        vip: 1
    },{
        id: 1542622318086,
        pid: 0,
        position: {x: 0.496875, y: 0.4979166666666667},
        text: "超可爱de",
        vip: 0
    },{
        id: 1542628367202,
        pid: 0,
        position: {x: 0.5078125, y: 0.746875},
        text: "好看好看好看",
        vip: 2
    },{
        id: 1542628411068,
        pid: 0,
        position: {x: 0.3421875, y: 0.615},
        text: "哇噻~好美",
        vip: 1
    }
];